export const Conditions = `제 1 조 (목적)
이 약관은 ShadowMate(이하 "사이트"라 합니다)에서 제공하는 인터넷서비스(이하 "서비스"라 합니다)의 이용 조건 및 절차에 관한 기본적인 사항을 규정함을 목적으로 합니다.

제 2 조 (약관의 효력 및 변경)
① 이 약관은 서비스 화면이나 기타의 방법으로 이용고객에게 공지함으로써 효력을 발생합니다.
② 사이트는 이 약관의 내용을 변경할 수 있으며, 변경된 약관은 제1항과 같은 방법으로 공지 또는 통지함으로써 효력을 발생합니다.

제 3 조 (용어의 정의)
이 약관에서 사용하는 용어의 정의는 다음과 같습니다.
① 회원 : 사이트와 서비스 이용계약을 체결하거나 이용자 닉네임을 부여받은 자를 말합니다.
⑧ 운영자 : 사이트를 운영하는 NewSainTurtle 스터디 그룹에 소속된 자를 말합니다.
② 신청자 : 서비스를 이용하고자 회원가입을 신청자를 말합니다.
③ 이메일 : 회원의 식별과 서비스 이용을 위하여 회원이 인증하고 사이트가 승인하는 이메일 주소를 말합니다.
④ 닉네임 : 회원의 식별과 서비스 이용을 위하여 회원이 정하고 사이트가 승인하는 문자의 조합을 말합니다.
⑤ 비밀번호 : 회원이 부여 받은 이메일과 일치된 회원임을 확인하고, 회원 자신의 비밀을 보호하기 위하여 회원이 정한 문자와 숫자의 조합을 말합니다.
⑥ 게시물 : 회원이 사이트가 제공하는 서비스에 게시한 부호ㆍ문자ㆍ음성ㆍ음향ㆍ영상 등의 정보 형태의 글, 사진, 동영상 및 각종 파일과 링크 등을 말합니다.
⑦ 해지 : 사이트 또는 회원이 서비스 이용계약을 취소하는 것을 말합니다.

제 4 조 (이용계약의 성립)
① 이용약관 상단의 동의 버튼을 누르면 이 약관에 동의하는 것으로 간주됩니다.
② 이용계약은 서비스 이용희망자의 이용약관 동의 후 이용 신청에 대하여 사이트가 승낙함으로써 성립합니다.
③ 이용계약의 성립 시기는 사이트에 가입완료를 신청절차 상에서 표시한 시점으로 합니다.

제 5 조 (이용신청)
① 신청자가 본 서비스를 이용하기 위해서는 사이트 소정의 가입신청 양식에서 요구하는 이용자 정보를 기록하여 제출해야 합니다.
② 신청자는 운영자가 정한 신청양식에 본인의 이메일 및 닉네임 등 필수사항을 입력하고, "Signup" 버튼을 누름으로써 서비스 이용신청을 할 수 있습니다. 다만, 운영자가 필요하다고 인정하는 경우 이용신청자에게 별도의 서류 제출을 요구할 수 있습니다.
③ 전항에 따른 이용신청에 있어 운영자는 회원의 종류에 따라 전문기관을 통한 실명 확인 및 본인인증을 요청할 수 있습니다.

제 6 조 (이용신청의 승낙)
① 사이트는 신청자에 대하여 제2항, 제3항의 경우를 예외로 하여 서비스 이용신청을 승낙합니다.
② 사이트는 다음에 해당하는 경우에 그 신청에 대한 승낙 제한사유가 해소될 때까지 승낙을 유보할 수 있습니다.
가. 서비스 관련 설비에 여유가 없는 경우
나. 기술상 문제가 있다고 판단되는 경우
다. 기타 사이트가 필요하다고 인정되는 경우
③ 사이트는 신청자가 다음에 해당하는 경우에는 승낙을 거부할 수 있습니다.
가. 다른 개인(사이트)의 이메일을 사용하여 신청한 경우
나. 이용자 정보를 허위로 기재하여 신청한 경우
다. 회원의 귀책사유에 의하여 회원자격을 상실한 적이 있는 경우. 단, 운영자의 회원 재가입 승낙을 얻은 경우에는 예외로 함
라. 기타 사이트 소정의 이용신청요건을 충족하지 못하는 경우

제 7 조 (이용자정보의 변경)
회원은 서비스 상의 회원정보 관리페이지에서 본인의 개인정보를 열람하고 수정할 수 있습니다. 다만, 서비스 관리를 위해 필요한 이메일은 수정이 불가능합니다.

제 8 조 (사이트의 의무)
① 사이트는 회원에게 각 호의 서비스를 제공합니다.
가. 할일 등록, 관리를 위한 각종 부가서비스
나. 커뮤니케이션, 공유를 위한 기회 제공
② 사이트는 서비스 제공과 관련하여 취득한 회원의 개인정보를 회원의 동의없이 타인에게 누설, 공개 또는 배포할 수 없으며, 서비스관련 업무 이외의 상업적 목적으로 사용할 수 없습니다. 단, 다음 각 호의 1에 해당하는 경우는 예외입니다.
가. 전기통신기본법 등 법률의 규정에 의해 국가기관의 요구가 있는 경우
나. 범죄에 대한 수사상의 목적이 있거나 정보통신윤리 위원회의 요청이 있는 경우
다. 기타 관계법령에서 정한 절차에 따른 요청이 있는 경우
③ 사이트는 이 약관에서 정한 바에 따라 지속적, 안정적으로 서비스를 제공할 의무가 있습니다.

제 9 조 (회원의 의무)
① 회원은 서비스 이용 시 다음 각 호의 행위를 하지 않아야 합니다.
가. 다른 회원의 닉네임을 부정하게 사용하는 행위
나. 서비스에서 얻은 정보를 사이트의 사전승낙 없이 회원의 이용 이외의 목적으로 복제하거나 이를 변경, 출판 및 방송 등에 사용하거나 타인에게 제공하는 행위
다. 사이트의 저작권, 타인의 저작권 등 기타 권리를 침해하는 행위
라. 공공질서 및 미풍양속에 위반되는 내용의 정보, 문장, 도형 등을 타인에게 유포하는 행위
마. 범죄와 결부된다고 객관적으로 판단되는 행위
바. 기타 관계법령에 위배되는 행위
② 회원은 관계법령, 이 약관에서 규정하는 사항, 서비스 이용 안내 및 주의 사항을 준수하여야 합니다.
③ 회원은 내용별로 사이트가 서비스 공지사항에 게시하거나 별도로 공지한 이용 제한 사항을 준수하여야 합니다.

제 10 조 (회원 이메일과 비밀번호 및 닉네임 관리에 대한 회원의 의무)
① 이메일과 비밀번호에 대한 모든 관리는 회원에게 책임이 있습니다. 회원에게 부여된 닉네임과 비밀번호의 관리소홀, 부정사용에 의하여 발생하는 모든 결과에 대한 전적인 책임은 회원에게 있습니다.
② 자신의 이메일과 닉네임이 부정하게 사용된 경우 또는 기타 보안 위반에 대하여, 회원은 반드시 사이트에 그 사실을 통보해야 합니다.

제 11 조 (서비스 제한 및 정지)
① 사이트는 전시, 사변, 천재지변 또는 이에 준하는 국가비상사태가 발생하거나 발생할 우려가 있는 경우와 전기통신사업법에 의한 기간통신 사업자가 전기통신서비스를 중지하는 등 기타 불가항력적 사유가 있는 경우에는 서비스의 전부 또는 일부를 제한하거나 정지할 수 있습니다.
② 사이트는 제1항의 규정에 의하여 서비스의 이용을 제한하거나 정지할 때에는 그 사유 및 제한기간 등을 지체없이 회원에게 알려야 합니다.

제 12 조 (정보의 변경)
회원이 닉네임, 비밀번호 등 고객정보를 변경하고자 하는 경우에는 홈페이지의 회원정보 변경 서비스를 이용하여 변경할 수 있습니다.

제 13 조 (계약사항의 해지)
회원은 서비스 이용계약을 해지할 수 있으며, 해지할 경우에는 본인이 직접 서비스 사이트에 해지신청을 하여야 합니다. 사이트는 해지신청이 접수된 시간부터 해당 회원의 서비스 이용을 제한합니다. 사이트는 회원이 다음 각 항의 1에 해당하여 이용계약을 해지하고자 할 경우에는 해지조치 7일전까지 그 뜻을 이용고객에게 통지하여 소명할 기회를 주어야 합니다.
① 이용고객이 이용제한 규정을 위반하거나 그 이용제한 기간 내에 제한 사유를 해소하지 않는 경우
② 정보통신윤리위원회가 이용해지를 요구한 경우
③ 이용고객이 정당한 사유 없이 의견진술에 응하지 아니한 경우
④ 타인 이메일로 이용계약을 체결한 경우
사이트는 상기 규정에 의하여 해지된 이용고객에 대해서는 별도로 정한 기간동안 가입을 제한할 수 있습니다.

제 14 조 (면책조항)
① 사이트는 회원이 서비스 제공으로부터 기대되는 이익을 얻지 못하였거나 서비스 자료에 대한 취사선택 또는 이용으로 발생하는 손해 등에 대해서는 책임이 면제됩니다.
② 사이트는 회원의 귀책사유나 제3자의 고의로 인하여 서비스에 장애가 발생하거나 회원의 데이터가 훼손된 경우에 책임이 면제됩니다.
③ 사이트는 회원이 게시 또는 전송한 자료의 내용에 대해서는 책임이 면제됩니다.
④ 운영자는 회원 상호간 또는 회원과 제3자 상호간에 서비스를 매개로 발생한 분쟁에 대해서는 개입할 의무가 없으며 이로 인한 손해를 배상할 책임도 없습니다.

제 15 조 (분쟁의 해결)
① 본 약관은 대한민국법령에 의하여 규정되고 이행됩니다.
② 서비스와 관련하여 사이트와 회원간에 발생한 분쟁에 대해서는 민사소송법상의 법원을 관할법원으로 합니다.

[부칙]

본 이용약관은 2023년 12월 6일부터 시행합니다.`;

export const PersonalInformation = `ShadowMate 서비스 운영자(이하 "운영자"라 합니다)는 이용자의 개인정보를 소중하게 생각하고, 이용자의 개인정보를 보호하기 위하여 최선의 노력을 다하고 있습니다. 

운영자는 "정보통신망 이용촉진 및 정보보호 등에 관한 법률" 상의 개인정보보호 규정 및 방송통신위원회가 제정한 "개인정보보호지침"을 준수하고 있습니다.

운영자는 관련 법령에 의거한 개인정보취급방침을 정하여 이용자에게 본인의 개인정보가 어떠한 용도와 방식으로 이용되며, 개인정보 보호를 위해 어떠한 조치를 취하는지에 대해 알려 드립니다. 또한 본 방침을 사이트에 공개하여 이용자가 언제나 쉽게 열람할 수 있도록 하고 있습니다.

본 방침은 2023년 12월 06일부터 시행됩니다.

1. 개인정보의 수집 및 이용목적
운영자가 수집한 개인정보는 다음의 목적을 위해 활용됩니다.

① 회원관리
  • 회원제 서비스 이용에 따른 본인확인, 개인식별
  • 불량회원의 부정이용 방지와 비인가 사용 방지
  • 불만처리 등 민원처리
  • 분쟁조정을 위한 기록보존
  • 고지사항 전달
② 마케팅 및 광고에 활용
  • 신규 서비스(제품) 개발 및 특화
  • 회원에게 최적화된 서비스 제공
  • 인구통계학적 특성에 따른 서비스 제공 및 광고 게재
  • 서비스 이용에 대한 통계

2. 수집하는 개인정보 항목 및 수집방법
운영자는 회원가입 시 개인정보수집에 대한 동의를 받고 있습니다. 개인정보수집과 관련하여 운영자의 이용약관과 개인정보수집 및 이용에 대해 「동의함」 버튼을 클릭할 수 있는 절차를 마련하고 있으며, 「동의함」 버튼을 클릭하면 개인정보 수집에 대해 동의한 것으로 봅니다.
운영자가 수집하는 개인정보는 필수항목과 선택항목으로 구분됩니다.

① 수집항목
운영자는 회원가입, 고객상담, 서비스 제공을 위하여 다음과 같이 필요한 최소한의 개인정보만을 수집합니다.
  <간편 회원, 회원가입 시>
    • 필수항목 : 이메일주소, 비밀번호, 닉네임
    • 선택항목 : 상태메세지, 프로필 이미지

② 수집방법
운영자는 다음과 같은 방법으로 개인정보를 수집하고 해당 목적을 달성하기 위해서만 사용합니다.
 • 홈페이지를 통한 회원가입, 회원정보 수정, 서비스에 따른 회원정보 추가 기입 및 수정, 서비스 이용, 고객센터 문의를 통한 수집

3. 개인정보의 보유 및 이용기간
운영자는 원칙적으로 개인정보 수집 및 이용목적이 달성된 후에는 해당 정보를 지체 없이 파기합니다. 단, 다음의 정보에 대해서는 아래의 이유로 명시한 기간 동안 보존합니다.

① 운영자 내부방침에 의한 정보보유 및 기간
 • 보존항목 : 이메일주소, 닉네임
 • 보존근거 : 서비스 이용의 혼선 방지, 불법적 이용자에 대한 관련 기관 수사협조
 • 보존기간 : 1년

4. 개인정보의 파기절차 및 방법
운영자는 원칙적으로 개인정보 수집 및 이용목적이 달성되거나, 보유 및 이용기간이 경과된 후에는 해당 정보를 지체 없이 파기합니다. 파기절차 및 방법은 다음과 같습니다.

① 파기절차
이용자가 회원가입 등을 위해 입력한 정보는 수집 및 이용목적이 달성된 후 별도의 DB로 옮겨져(종이의 경우 별도의 서류함) 내부 방침 및 기타 관련 법령에 의한 정보보호 사유(보유 및 이용기간 참조)에 따라 일정 기간 저장된 후 파기됩니다.
개인정보는 법률에 의한 경우가 아니고서는 보유되는 이외의 다른 목적으로 이용되지 않습니다.
② 파기방법
DB 등 전자적 파일 형태로 저장된 개인정보 : 재생할 수 없는 기술적 방법으로 삭제

5. 개인정보의 공유 및 제공
운영자는 이용자들의 개인정보를 "1. 개인정보의 수집 및 이용목적"에서 고지한 범위 내에서 이용하며,
범위를 초과하여 이용하거나 이용자의 개인정보를 제3자에 제공하지 않습니다.

단, 다음의 경우에는 주의를 기울여 개인정보를 이용 및 제공할 수 있습니다.

① 이용자들이 사전에 동의한 경우
② 법령의 규정에 의거하거나, 수사 목적으로 법령에 정해진 절차와 방법에 따라 수사기관의 요구가 있는 경우

6. 이용자의 권리와 그 행사방법
① 이용자의 개인정보 조회/수정을 위해서는 '개인정보변경'(또는 '회원정보수정' 등)을, 가입해지(동의철회)를 위해서는 "’회원탈퇴’"를 클릭하여 본인 확인 절차를 거치신 후 직접 열람, 정정 또는 탈퇴가 가능합니다.
② 이용자의 개인정보의 오류에 대한 정정을 요청한 경우에는 정정을 완료하기 전까지 당해 개인정보를 이용 또는 제공하지 않습니다. 또한 잘못된 개인정보를 제3자에게 이미 제공한 경우에는 정정 처리결과를 제3자에게 지체 없이 통지하여 정정이 이루어지도록 하겠습니다.
③ 운영자는 이용자 혹은 법정 대리인의 요청에 의해 해지 또는 삭제된 개인정보는 "3. 개인정보의 보유 및 이용기간"에 명시된 바에 따라 처리하고 그 외의 용도로 열람 또는 이용할 수 없도록 처리하고 있습니다.

7. 개인정보 자동 수집 장치의 설치/운영 및 거부에 관한 사항
운영자는 이용자에게 특화된 맞춤서비스를 제공하기 위해서 이용자의 정보를 수시로 저장하고 불러오는 '로컬 스토리지(localStorage)'를 사용합니다. 로컬 스토리지는 컴퓨터 브라우저에 저장되는 작은 텍스트 데이터입니다.

① 로컬 스토리지의 사용 목적
 • 개인 맞춤서비스 제공

8. 개인정보보호를 위한 기술적/관리적 대책
운영자는 이용자의 개인정보를 취급함에 있어 개인정보가 분실, 도난, 누출, 변조 또는 훼손되지 않도록 안정성 확보를 위하여 다음과 같은 기술적/관리적 대책을 강구하고 있습니다.

① 기술적 보호 대책
이용자의 개인정보는 비밀번호에 의해 보호되며, 중요한 데이터는 파일 및 전송 데이터를 암호화하거나 파일 잠금기능을 사용하는 등 별도 보안기능을 통해 보호되고 있습니다.
백신 프로그램을 이용하여 컴퓨터바이러스에 의한 피해를 방지하기 위한 조치를 취하고 있습니다. 백신프로그램은 주기적으로 업데이트되며 갑작스런 바이러스가 출현할 경우 백신이 나오는 즉시 이를 적용함으로써 개인정보가 침해되는 것을 방지하고 있습니다.
네트워크 상의 개인정보 및 개인인증정보를 안전하게 전송할 수 있는 보안장치(SSL)를 채택하고 있습니다.
해킹 등에 의해 고객의 개인정보가 유출되는 것을 방지하기 위하여, 외부 침입을 차단하는 장치를 이용하고 있으며, 침입탐지시스템을 설치하여 24시간 감시하고 있습니다.
② 관리적 보호 대책
운영자는 이용자의 개인정보를 취급할 수 있는 자를 최소한으로 제한하고, 별도의 비밀번호를 부여하여 접근 권한을 관리하고 있습니다. 
운영자는 이용자의 개인적인 부주의로 이메일, 비밀번호 등 개인정보가 유출되어 발생한 문제와 기본적인 인터넷의 위험성 때문에 일어나는 일들에 대해 책임을 지지 않습니다.
이용자의 이메일과 비밀번호는 반드시 본인만 사용하고, 비밀번호를 자주 변경하며, 공용PC에서의 로그인시 개인정보가 유출되지 않도록 각별한 주의를 기울여 주시기 바랍니다.

9. 개인정보 관리책임자 및 상담/신고
운영자는 이용자의 개인정보를 보호하고 개인정보와 관련한 불만 및 문의를 처리하기 위하여 아래와 같이 개인정보 관리책임자를 지정하고 있습니다.
이용자는 운영자의 서비스를 이용하며 발생하는 모든 개인정보보호 관련 민원을 개인정보관리책임자 또는 담당부서로 신고할 수 있으며, 운영자는 이용자들의 신고사항에 대해 신속하게 충분한 답변을 드릴 것입니다.

① 개인정보 관리책임자
소속 : NewShainTutle 스터디 그룹
이메일 : shadowmate127@naver.com

② 기타 개인정보침해에 대한 신고나 상담이 필요하신 경우에는 아래 기관에 문의하시기 바랍니다.
개인정보침해신고센터 : 118ㅣwww.118.or.kr
대검찰청 첨단범죄수사과 : 02-3480-2000ㅣwww.spo.go.kr
경찰청 사이버테러대응센터 : 02-393-9112ㅣwww.netan.go.kr

10. 기타
본 개인정보취급방침은 ShadowMate 사이트 이외의 링크된 다른 웹사이트(운영자가 운영하지 않는 웹사이트를 말합니다)에서는 적용되지 않습니다.

[부칙]

본 개인정보취급방침은 2023년 12월 6일부터 적용됩니다.`;
